code/openfoam/test/Lagrangian/boundaries/0/Lagrangian/kinematicParticle/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       LagrangianVectorField;
    location    "0/Lagrangian/kinematicParticle";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [velocity];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    open
    {
        type            escapeVelocity;
    }

    nonCouple
    {
        type            reboundVelocity;
        e               0.97;
        mu              0.09;
    }

    walls
    {
        type            reboundVelocity;
        e               0.97;
        mu              0.09;
    }
}

sources
{
    injectionSlabOpen
    {
        type            uniformFixedValue;
        uniformValue    (1 0 2);
    }

    injectionWedgeOpen
    {
        type            uniformFixedValue;
        uniformValue    (1 0 2);
    }

    injectionSlabSymmetry
    {
        type            uniformFixedValue;
        uniformValue    (1.2 -0.1 0);
    }

    injectionWedgeSymmetry
    {
        type            uniformFixedValue;
        uniformValue    (1.2 -0.2 0);
    }

    injectionSlabSymmetryPlane
    {
        type            uniformFixedValue;
        uniformValue    (1.2 -0.1 0);
    }

    injectionWedgeSymmetryPlane
    {
        type            uniformFixedValue;
        uniformValue    (1.2 -0.2 0);
    }

    injectionSlabCyclic
    {
        type            uniformFixedValue;
        uniformValue    (2 -0.1 0);
    }

    injectionWedgeCyclic
    {
        type            uniformFixedValue;
        uniformValue    (1 -0.4 0);
    }

    injectionSlabNonConformalCyclic
    {
        type            coneVelocity;
        Ucentre         (1.2 -0.18 0);
        thetaInner      0;
        thetaOuter      1;
    }

    injectionWedgeNonConformalCyclic
    {
        type            coneVelocity;
        Ucentre         (0.6 -0.22 0);
        thetaInner      0;
        thetaOuter      1;
    }
}


// ************************************************************************* //
